app/controllers/posts_controller.rb

SELECT * FROM "posts"
---
  def index
    @posts = Post.all

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2010-03-11 16:31:33', 'asd', 'config.gem "thoughtbot-factory_girl", :lib => ''factory_girl'', :source => ''http://gems.github.com''
---
  def create
    @post = Post.new(params[:post])
    if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def edit
    @post = Post.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "posts" WHERE "id" = 1
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy